# Operations

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [3]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [8]:
df['col2'].unique() # returns the numpy array of unique values in col2

array([444, 555, 666])

In [10]:
df['col2'].value_counts() # returns the number of times unique value is occurred in the col2

444    2
555    1
666    1
Name: col2, dtype: int64

In [12]:
df[(df['col2']>2)]

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [22]:
df[(df['col2']==444 ) & (df['col1']>2) ]

   col1  col2 col3
3     4   444  xyz

In [18]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

apply finction can be used to apply some uer defined function on each element in the column or row of the dataset

In [23]:
df['col2'].apply(lambda x:x**2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [24]:
def udf(x):
    return len(x)

In [25]:
df['col3'].apply(udf)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [30]:
# remove columns
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [34]:
df.columns

Index([u'col1', u'col2', u'col3'], dtype='object')

In [35]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [36]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [37]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [38]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C         x   y
A   B
bar one   4   1
    two NaN   5
foo one   1   3
    two   2 NaN